     A                                      UNIQUE
     A          R R00                       PFILE(ANZAPP00)

     A          K F0APPS
     A          K F0PGM
     A          K F0OBJ
     A          K F0OBJT
