      *******************************************************
      * USER LAST USED APP SYSTEM
      *******************************************************

     A          R R90                       TEXT('USER LAST USED APPS')

     A            F9USR         10          TEXT('USER NAME')
     A            F9APPS        10          TEXT('APP SYS')
     A          K F9USR
